{"0": {"3005": {"title": "Jeremiah Johnson (1972)", "genre": ["Western"], "actors": ["Edmond O'Brien", "Frank Lovejoy", "William Talman"], "overview": "As a penalty for fighting fellow classmates days before graduating from West Point, J.E.B. Stuart, George Armstrong Custer and four friends are assigned to the 2nd Cavalry, stationed at Fort Leavenworth. While there they aid in the capture and execution of the abolitionist, John Brown following the Battle of Harper's Ferry."}, "1407": {"title": "Beverly Hills Ninja (1997)", "genre": ["Action", "Comedy"], "actors": ["Dennis Farina", "Paula Marshall", "Danny Nucci"], "overview": "A tormented jazz musician finds himself lost in an enigmatic story involving murder, surveillance, gangsters, doppelgangers, and an impossible transformation inside a prison cell."}, "32": {"title": "Wings of Courage (1995)", "genre": ["Adventure", "Romance"], "actors": ["Bruce Willis", "Madeleine Stowe", "Brad Pitt"], "overview": NaN}, "1252": {"title": "Patton (1970)", "genre": ["Drama", "War"], "actors": ["Val Kilmer", "Gabriel Jarret", "Michelle Meyrink"], "overview": "A troubled rock star descends into madness in the midst of his physical and social isolation from everyone."}, "1982": {"title": "Herbie Goes to Monte Carlo (1977)", "genre": ["Adventure", "Children's", "Comedy"], "actors": ["Bob Newhart", "Eva Gabor", "Geraldine Page"], "overview": "In this sequal to \"Escape From Witch Mountain,\" Tia and Tony leave their safe refuge on witch mountain for a trip to Los Angeles. Tony is kidnapped by the evil Dr. Gannon and his spinster partner Letha and brainwashed into helping Gannon and Letha commit various crimes. It's up to Tia and a gang of truant kids to rescue Tony and prevent a major disaster."}, "3408": {"title": "Empire Records (1995)", "genre": ["Comedy", "Drama"], "actors": ["Nick Nolte", "Barbra Streisand", "Blythe Danner"], "overview": "This remake of the 1946 movie of the same name accounts an affair between a seedy drifter and a seductive wife of a roadside cafe owner. This begins a chain of events that culminates in murder. Based on a novel by James M. Cain."}, "253": {"title": "Junior (1994)", "genre": ["Comedy", "Sci-Fi"], "actors": ["Arnold Schwarzenegger", "Danny DeVito", "Emma Thompson"], "overview": "Bobby Earl is facing the electric chair for the murder of a young girl. Eight years after the crime he calls in Paul Armstrong, a professor of law, to help prove his innocence. Armstrong quickly uncovers some overlooked evidence to present to the local police, but they aren't interested - Bobby was their killer."}, "1717": {"title": "Tokyo Fist (1995)", "genre": ["Action", "Drama"], "actors": ["Kenneth Branagh", "Madeleine Stowe", "William Hurt"], "overview": "A pregnant New York social worker begins to develop romantic feelings for her gay best friend, and decides she'd rather raise her child with him, much to the dismay of her overbearing boyfriend."}, "2762": {"title": "Dog of Flanders, A (1999)", "genre": ["Drama"], "actors": ["Oliver Reed", "Ann-Margret", "Roger Daltrey"], "overview": "Four college pledges are forced to spend the night in a deserted old mansion where they get killed off one by one by the monstrous surviving members of a family massacre years earlier for trespassing on their living grounds."}, "3785": {"title": "Affair of Love, An (Une Liaison Pornographique) (1999)", "genre": ["Drama", "Romance"], "actors": ["Jennifer Morrison", "Matthew Davis", "Loretta Devine"], "overview": "Set to the intoxicating rhythms of Brazil, \"Woman on Top\" is a spicy, sexy comedy about the magic of food, love and music. Meet Isabella, a sultry enchantress born with the special gift of melting the palates and hearts of men everywhere. When she decides to break free from her rocky marriage and the stifling kitchen of her husband's restaurant in Brazil, she spirits off to San Francisco in pursuit of her dreams of a real culinary career."}, "3409": {"title": "Bamba, La (1987)", "genre": ["Drama"], "actors": ["Jack Nicholson", "Jessica Lange", "John Colicos"], "overview": "\"Smoking\" and \"No Smoking\" are two segments of the film which are based on closely connected plays. The original plays covered eight separate stories, which have been pared down to three each for these movies. At a certain point in the story of each segment, the five female characters (all played by Sabine Azema) and the four male characters (all played by Pierre Arditi) have their lives skillfully recapped in terms of \"what might have happened\" if they had made or failed to make certain choices. For example, \"No Smoking\" focuses chiefly on the relationship between the mild-mannered Miles Coombes and his infinitely more aggressive and ambitious wife, Rowena."}, "2288": {"title": "Central Station (Central do Brasil) (1998)", "genre": ["Drama"], "actors": ["Sam Elliott", "Cloris Leachman", "Rutanya Alda"], "overview": "A small gold mining camp is terrorised by a ruthless land owner wanting to take their land. Clint Eastwood arrives riding a pale horse just as a young girl is praying to God to help the miners. He is revealed to be a preacher with mysterious and possible otherworldly origins who teams up with the miners to defeat the land owner and the corrupt sheriff."}, "2003": {"title": "'burbs, The (1989)", "genre": ["Comedy"], "actors": ["Steve Martin", "Kathleen Turner", "David Warner"], "overview": "Grand Canyon revolved around six residents from different backgrounds whose lives intertwine in modern-day Los Angeles. At the center of the film is the unlikely friendship of two men from different races and classes brought together when one finds himself in jeopardy in the other's rough neighborhood."}, "1219": {"title": "Local Hero (1983)", "genre": ["Comedy"], "actors": ["Robert De Niro", "John Cazale", "John Savage"], "overview": "Jules, a young Parisian postman, secretly records a concert performance given by the opera singer Cynthia Hawkins, whom he idolises. The following day, Jules runs into a woman who is being pursued by armed thugs. Before she is killed, the woman slips an audio cassette into his mail bag..."}, "1527": {"title": "Last Time I Committed Suicide, The (1997)", "genre": ["Drama"], "actors": ["Michael Keaton", "Andy García", "Brian Cox"], "overview": "Justice. Safe streets. Payback. Metallurgist John Henry Irons (O'Neal) vows to claim them all when a renegade military reject (Judd Nelson) puts new superweapons in dangerous hands. Helped by an electronics wiz (Annabeth Gish) and an imaginative scrap metal worker (Richard Roundtree), Irons becomes Steel. Wearing body armor, wielding a fearsome electrohammer and riding a gadget-packed motorcycle, he's ready to wage war...if he can fix the untimely glitches in his untested gear. \"You all be cool now,\" the good-guy hero tells two crime victims he rescues. There'll be a lot of thrillin' before Steel himself can start chillin.'"}, "1529": {"title": "My Best Friend's Wedding (1997)", "genre": ["Comedy", "Romance"], "actors": ["Sean Penn", "Robin Wright", "John Travolta"], "overview": "In 1934, the second most lucrative business in New York City was running \"the numbers\". When, Madam Queen, the powerful woman who runs the scam in Harlem, is arrested. Ellsworth \"Bumpy\" Johnson takes over the business and must resist against the invasion from merciless mobster Dutch Shultz."}, "3324": {"title": "Date with an Angel (1987)", "genre": ["Comedy", "Fantasy"], "actors": ["Mike Norris", "Steve Durham", "David Coburn"], "overview": "Frank Dux has entered the \"kumite\", an illegal underground martial-arts competition where serious injury and even death are not unknown. Chong Li, a particularly ruthless and vicious fighter is the favorite, but then again Dux has not fought him yet."}, "50": {"title": "Guardian Angel (1994)", "genre": ["Action", "Drama", "Thriller"], "actors": ["Stephen Baldwin", "Gabriel Byrne", "Chazz Palminteri"], "overview": "Detective - turned - bodyguard Cynthia McKay (Cynthia Rothrock) is hired by a psychotic icy seductress, Nina Lindell (Lydie Denier), the same woman who killed Mckay's lover months earlier.  With vendetta in her heart McKay accompanies the flamboyantly playful womanizer through the glamourous world of the super-rich as his protector.  In a unique role reversal, it is the woman protecting the man from another woman, erupting into a deadly triangle of passion, suspense and action."}, "2161": {"title": "Always Tell Your Wife (1923)", "genre": ["Comedy"], "actors": ["Jackie Chan", "Chris Tucker", "Ken Leung"], "overview": "For forty years Lilian Singer has been locked up in a 'loony bin' by her father. Her release is eventually secured by her eccentric Aunt Kitty and her brother, John. Lilian starts to carve out a place for herself. As she explores Sydney and the people who live and work around her she sees others looking for love. Lilian shows us it is never too late to change your life and that even unusual choices can bring contentment."}, "1704": {"title": "Duoluo tianshi (1995)", "genre": ["Drama"], "actors": ["Matthew McConaughey", "Skeet Ulrich", "Ethan Hawke"], "overview": "When teen-socialite Kelly Van Ryan (Richards) and troubled bad girl Suzie Toller (Campbell) accuse guidance counselor Sam Lombardo (Dillon) of rape, he's suspended by the school, rejected by the town, and fighting to get his life back. One cop (Bacon) suspects conspiracy, but nothing is what it seems..."}}}